import random
import time
import telebot
from telebot import types

bot = telebot.TeleBot("5336215402:AAE8b5KUE2beFe7_kTGAhPz5M6Qyvw9nnl0")

@bot.message_handler(commands=['rir8xj282jd92di92unieow'])
def start(message):
	lists = [('''﷽ : ❰ هَمَّازٍ مَشَّاءٍ بِنَمِيمٍ ﴿١١﴾ ❱

〔 سورة القلم | الجُزْءُ الْتَّاسِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٦٨ | عدد آيات السُورة : ٥٢ ❫'''),('''﷽ : ❰ وَقَوْمَ نُوحٍ مِنْ قَبْلُ ۖ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ ﴿٤٦﴾ ❱

〔 سورة الذاريات | الجُزْءُ الْسَّابِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٥١ | عدد آيات السُورة : ٦٠ ❫'''),('''﷽ : ❰ كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۗ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيَامَةِ ۖ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَأُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ ۗ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ ﴿١٨٥﴾ ❱

〔 سورة آل عمران | الجُزْءُ الرَّابع 〕
 ❪ السُورة : ٣ | عدد آيات السُورة : ٢٠٠ ❫'''),('''﷽ : ❰ الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ ﴿٧﴾ ❱

〔 سورة فصلت | الجُزْءُ الْرَّابِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٤١ | عدد آيات السُورة : ٥٤ ❫'''),('''﷽ : ❰ الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ ﴿٧﴾ ❱

〔 سورة فصلت | الجُزْءُ الْرَّابِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٤١ | عدد آيات السُورة : ٥٤ ❫'''),('''﷽ : ❰ فَأَنْتَ عَنْهُ تَلَهَّىٰ ﴿١٠﴾ ❱

〔 سورة عبس | الجُزْءُ الْثَّلاثُونْ 〕
 ❪ السُورة : ٨٠ | عدد آيات السُورة : ٤٢ ❫'''),('''﷽ : ❰ فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ ﴿١٧﴾ ❱

〔 سورة الحشر | الجُزْءُ الْثَّامِنُ والْعِشْرُونْ 〕
 ❪ السُورة : ٥٩ | عدد آيات السُورة : ٢٤ ❫'''),('''﷽ : ❰ وَهُوَ الَّذِي أَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۗ إِنَّ الْإِنْسَانَ لَكَفُورٌ ﴿٦٦﴾ ❱

〔 سورة الحج | الجُزْءُ الْسَابِعَ عَشَرْ 〕
 ❪ السُورة : ٢٢ | عدد آيات السُورة : ٧٨ ❫'''),('''﷽ : ❰ قَالُوا أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ ۖ قَالُوا بَلَىٰ ۚ قَالُوا فَادْعُوا ۗ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ ﴿٥٠﴾ ❱

〔 سورة غافر | الجُزْءُ الْرَّابِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٤٠ | عدد آيات السُورة : ٨٥ ❫'''),('''﷽ : ❰ وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ ﴿١٠٥﴾ ❱

〔 سورة الأنبياء | الجُزْءُ الْسَابِعَ عَشَرْ 〕
 ❪ السُورة : ٢١ | عدد آيات السُورة : ١١٢ ❫'''),('''﷽ : ❰ دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ ﴿٩﴾ ❱

〔 سورة الصافات | الجُزْءُ الْثَّالِثُ والْعِشْرُونْ 〕
 ❪ السُورة : ٣٧ | عدد آيات السُورة : ١٨٢ ❫'''),('''﷽ : ❰ وَإِنَّ هَٰذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاتَّقُونِ ﴿٥٢﴾ ❱

〔 سورة المؤمنون | الجُزْءُ الْثَّامِنَ عَشَرْ 〕
 ❪ السُورة : ٢٣ | عدد آيات السُورة : ١١٨ ❫'''),('''﷽ : ❰ يَوْمَ يُنْفَخُ فِي الصُّورِ ۚ وَنَحْشُرُ الْمُجْرِمِينَ يَوْمَئِذٍ زُرْقًا ﴿١٠٢﴾ ❱

〔 سورة طه | الجُزْءُ الْسَّادِسَ عَشَرْ 〕
 ❪ السُورة : ٢٠ | عدد آيات السُورة : ١٣٥ ❫'''),('''﷽ : ❰ بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ ۚ وَمَا أَنَا عَلَيْكُمْ بِحَفِيظٍ ﴿٨٦﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ﴿٦﴾ ❱

〔 سُورَةُ ٱلْفَاتِحَةِ | الجُزْءُ الْأَوَّل 〕
 ❪ السُورة : ١ | عدد آيات السُورة : ٧ ❫'''),('''﷽ : ❰ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ﴿٦﴾ ❱

〔 سُورَةُ ٱلْفَاتِحَةِ | الجُزْءُ الْأَوَّل 〕
 ❪ السُورة : ١ | عدد آيات السُورة : ٧ ❫'''),('''﷽ : ❰ بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ ﴿٢﴾ ❱

〔 سورة ق | الجُزْءُ الْسَّادِسُ والْعِشْرُونْ 〕
 ❪ السُورة : ٥٠ | عدد آيات السُورة : ٤٥ ❫'''),('''﷽ : ❰ بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ ﴿٢﴾ ❱

〔 سورة ق | الجُزْءُ الْسَّادِسُ والْعِشْرُونْ 〕
 ❪ السُورة : ٥٠ | عدد آيات السُورة : ٤٥ ❫'''),('''﷽ : ❰ فَاسْتَقِمْ كَمَا أُمِرْتَ وَمَنْ تَابَ مَعَكَ وَلَا تَطْغَوْا ۚ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ﴿١١٢﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ ۚ قُلْ لَا أَتَّبِعُ أَهْوَاءَكُمْ ۙ قَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ ﴿٥٦﴾ ❱

〔 سورة الأنعام | الجُزْءُ السَّابع 〕
 ❪ السُورة : ٦ | عدد آيات السُورة : ١٦٥ ❫'''),('''﷽ : ❰ وَأُحِيطَ بِثَمَرِهِ فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلَىٰ مَا أَنْفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَا لَيْتَنِي لَمْ أُشْرِكْ بِرَبِّي أَحَدًا ﴿٤٢﴾ ❱

〔 سورة الكهف | الجُزْءُ الْخَامِسَ عَشَرْ 〕
 ❪ السُورة : ١٨ | عدد آيات السُورة : ١١٠ ❫'''),('''﷽ : ❰ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ ﴿٩١﴾ ❱

〔 سورة النمل | الجُزْءُ الْعِشْرُونْ 〕
 ❪ السُورة : ٢٧ | عدد آيات السُورة : ٩٣ ❫'''),('''﷽ : ❰ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ ﴿٩١﴾ ❱

〔 سورة النمل | الجُزْءُ الْعِشْرُونْ 〕
 ❪ السُورة : ٢٧ | عدد آيات السُورة : ٩٣ ❫'''),('''﷽ : ❰ وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ ۚ إِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ ﴿٧﴾ ❱

〔 سورة النحل | الجُزْءُ الْرَّابِعَ عَشَرْ 〕
 ❪ السُورة : ١٦ | عدد آيات السُورة : ١٢٨ ❫'''),('''﷽ : ❰ وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَنْ يَنْفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ ﴿٩﴾ ❱

〔 سورة القصص | الجُزْءُ الْعِشْرُونْ 〕
 ❪ السُورة : ٢٨ | عدد آيات السُورة : ٨٨ ❫'''),('''﷽ : ❰ إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَانَتْ لَهُمْ جَنَّاتُ الْفِرْدَوْسِ نُزُلًا ﴿١٠٧﴾ ❱

〔 سورة الكهف | الجُزْءُ الْسَّادِسَ عَشَرْ 〕
 ❪ السُورة : ١٨ | عدد آيات السُورة : ١١٠ ❫'''),('''﷽ : ❰ وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ ﴿٢٠٤﴾ ❱

〔 سورة الأعراف | الجُزْءُ التَّاسِع 〕
 ❪ السُورة : ٧ | عدد آيات السُورة : ٢٠٦ ❫'''),('''﷽ : ❰ وَإِنَّ رَبَّكَ لَيَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ ﴿٧٤﴾ ❱

〔 سورة النمل | الجُزْءُ الْعِشْرُونْ 〕
 ❪ السُورة : ٢٧ | عدد آيات السُورة : ٩٣ ❫'''),('''﷽ : ❰ فِرْعَوْنَ وَثَمُودَ ﴿١٨﴾ ❱

〔 سورة البروج | الجُزْءُ الْثَّلاثُونْ 〕
 ❪ السُورة : ٨٥ | عدد آيات السُورة : ٢٢ ❫'''),('''﷽ : ❰ لَقَدْ أَحْصَاهُمْ وَعَدَّهُمْ عَدًّا ﴿٩٤﴾ ❱

〔 سورة مريم | الجُزْءُ الْسَّادِسَ عَشَرْ 〕
 ❪ السُورة : ١٩ | عدد آيات السُورة : ٩٨ ❫'''),('''﷽ : ❰ وَمَا كَانَ هَٰذَا الْقُرْآنُ أَنْ يُفْتَرَىٰ مِنْ دُونِ اللَّهِ وَلَٰكِنْ تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ ﴿٣٧﴾ ❱

〔 سورة يونس | الجُزْءُ الْحَادِيَ عَشَرْ 〕
 ❪ السُورة : ١٠ | عدد آيات السُورة : ١٠٩ ❫'''),('''﷽ : ❰ وَلَوْ شِئْنَا لَآتَيْنَا كُلَّ نَفْسٍ هُدَاهَا وَلَٰكِنْ حَقَّ الْقَوْلُ مِنِّي لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ ﴿١٣﴾ ❱

〔 سورة السجدة | الجُزْءُ الْحَادِي والْعِشْرُونْ 〕
 ❪ السُورة : ٣٢ | عدد آيات السُورة : ٣٠ ❫'''),('''﷽ : ❰ إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا الْإِنْسَانُ ۖ إِنَّهُ كَانَ ظَلُومًا جَهُولًا ﴿٧٢﴾ ❱

〔 سورة الأحزاب | الجُزْءُ الْثَّانِي والْعِشْرُونْ 〕
 ❪ السُورة : ٣٣ | عدد آيات السُورة : ٧٣ ❫'''),('''﷽ : ❰ وَيَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ مَالًا ۖ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ ۚ وَمَا أَنَا بِطَارِدِ الَّذِينَ آمَنُوا ۚ إِنَّهُمْ مُلَاقُو رَبِّهِمْ وَلَٰكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ ﴿٢٩﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ فَأَصْبَحَ فِي الْمَدِينَةِ خَائِفًا يَتَرَقَّبُ فَإِذَا الَّذِي اسْتَنْصَرَهُ بِالْأَمْسِ يَسْتَصْرِخُهُ ۚ قَالَ لَهُ مُوسَىٰ إِنَّكَ لَغَوِيٌّ مُبِينٌ ﴿١٨﴾ ❱

〔 سورة القصص | الجُزْءُ الْعِشْرُونْ 〕
 ❪ السُورة : ٢٨ | عدد آيات السُورة : ٨٨ ❫'''),('''﷽ : ❰ ذَٰلِكَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الرَّحِيمُ ﴿٦﴾ ❱

〔 سورة السجدة | الجُزْءُ الْحَادِي والْعِشْرُونْ 〕
 ❪ السُورة : ٣٢ | عدد آيات السُورة : ٣٠ ❫'''),('''﷽ : ❰ إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئُونَ وَالنَّصَارَىٰ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَعَمِلَ صَالِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ ﴿٦٩﴾ ❱

〔 سورة المائدة | الجُزْءُ السَّادس 〕
 ❪ السُورة : ٥ | عدد آيات السُورة : ١٢٠ ❫'''),('''﷽ : ❰ إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ ﴿٢﴾ ❱

〔 سورة العصر | الجُزْءُ الْثَّلاثُونْ 〕
 ❪ السُورة : ١٠٣ | عدد آيات السُورة : ٣ ❫'''),('''﷽ : ❰ نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا ﴿٣﴾ ❱

〔 سورة المزمل | الجُزْءُ الْتَّاسِعُ والْعِشْرُونْ 〕
 ❪ السُورة : ٧٣ | عدد آيات السُورة : ٢٠ ❫'''),('''﷽ : ❰ يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ ۚ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ ﴿١٠٥﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ ۚ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ ﴿١٠٥﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ ۚ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ ﴿١٠٥﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ وَيَا قَوْمِ مَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ طَرَدْتُهُمْ ۚ أَفَلَا تَذَكَّرُونَ ﴿٣٠﴾ ❱

〔 سورة هود | الجُزْءُ الْثَّانِيَ عَشَرْ 〕
 ❪ السُورة : ١١ | عدد آيات السُورة : ١٢٣ ❫'''),('''﷽ : ❰ وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ لَا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ ۚ بَلَىٰ وَعْدًا عَلَيْهِ حَقًّا وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ ﴿٣٨﴾ ❱

〔 سورة النحل | الجُزْءُ الْرَّابِعَ عَشَرْ 〕
 ❪ السُورة : ١٦ | عدد آيات السُورة : ١٢٨ ❫'''),('''﷽ : ❰ وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ ﴿٣٤﴾ ❱

〔 سورة فاطر | الجُزْءُ الْثَّانِي والْعِشْرُونْ 〕
 ❪ السُورة : ٣٥ | عدد آيات السُورة : ٤٥ ❫'''),('''﷽ : ❰ فَأْتُوا بِآبَائِنَا إِنْ كُنْتُمْ صَادِقِينَ ﴿٣٦﴾ ❱

〔 سورة الدخان | الجُزْءُ الْخَامِسُ والْعِشْرُونْ 〕
 ❪ السُورة : ٤٤ | عدد آيات السُورة : ٥٩ ❫''')]
	while True:
		rd = str(''.join((random.choice(lists) for i in range(1))))
		bot.send_message(message.chat.id,rd)
		time.sleep(7200)

@bot.message_handler(commands=["start"])
def start(message):
    if message.chat.type == 'private':
        first = message.from_user.first_name
        mas = types.InlineKeyboardMarkup(row_width=1)
        z222 = types.InlineKeyboardButton(f'• نسألكم الدعاء •', url=f'https://t.me/hsshh')
        mas.add(z222)
        bot.send_message(message.chat.id,text=f"""أهلا بك عزيزي في بوت أجر
------‐------------------------
• تستطيع من خلال البوت أن تُفعل الاذكار ( كل ساعتين سيرسل البوت آية قرآنية بشكل عشوائية):

- لتفعيل الأذكار أرسل : /run 

• تستطيع ارسال "اجر" وسيرسل البوت دعاء عشوائي """,reply_markup=mas)

responses =  ["""
دعاء لبس الثوب الجديد
اللهم لك الحمد أنت كسوتنيه، أسألك من خيره
""",
 """
 دعاء لبس الثوب
الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة.
 """,
  """
دعاء الكرب
لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم
اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت
 """,
   """
  دعاء الهم والحزن
اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي.
 """,
   """
  دعاء قضاء الدين
اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك
 """,
   """
  دعاء الريح
اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به.
 """,
   """
  دعاء الرعـد
سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته 
 """,
   """
  دعاء زيارة القبور
السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين
 """,
    """
  دعاء السفر
اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل.
وإذا رجع قالهن وزاد فيهن ـ" آيبون ،تآئبون، عابدون ، لربنا حامدون 
 """,
   """
  دعاء المسافر للمقيم
استودعكم الله الذي لا تضيع ودائعه
 """,
   """
  دعـــاء النـــزول في مكــان
أعوذ بكلمات الله التامات من شر ما خلق
 """,
   """
  الدعاء بين السجدتين
رب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني
 """,
   """
  ما يقال في المجلس
رب اغفر لي وتب عليّ إنك أنت التواب الغفور (100 مرة قبل أن يقوم)
 """,
    """
  كفارة المجلس
سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك 
 """,
    """
  دعاء من رأى مبتلى
الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً
 """,
    """
  دعـاء الغـضـب
أعوذ بالله من الشيطان الرجيـم
 """,
    """
  الدعاء للمتزوج
بارك الله لك ، وبارك عليك ، وجمع بينكما في خير
 """,
    """
  دعاء المتزوج لنفسه
اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك
 """,
    """
 الدعاء قبل الجماع
بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا 
 """,
    """
دعاء العطاس
إذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم.  
 """,
    """
  الدعاء إذا أفطر عند أهل بيت
أفطر عندكم الصائمون ، وأكل طعامكم الأبرار ، وصلت عليكم الملائكة 
 """,
    """
  دعاء رؤية الهلال
الله أكبر ، اللهم أهله علينا بالأمن ، والإيمان والسلامة ، والإسلام ، والتوفيق لما تحب وترضى ربنا وربك الله.
 """,
    """
  دعاء من أصيب بمصيبة
إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها
 """,
    """
  الدعاء للمريض في عيادته
لابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات : أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي.
 """,
    """
  دعاء المريض الذي يئس من حياته
اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى 
 """,
    """
 ما يعوذ به الأولاد
أعيذكما بكلمات الله التامة من كل شيطان وهامة ، ومن كل عين لامة 
 """,
    """
 دعاء لقاء العدو وذي السلطان
حسـبنا الله ونعـم الـوكـيل
اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم
اللهم أنت عضدي ، وأنت نصيري ، بك أجول وبك أصول وبك أقاتل 
 """,
    """
  دعـاء صـلاة الاستخـارة
قال جابر بن عبدالله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الامور كلها كما يعلمنا السورة من القرآن ، يقول : ( إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به).
 """,
    """
  دعـاء سجود التلاوة
سجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك الله احسن الخالقين )
 """,
    """
 دعـــــاء الاستفــتــــاح
اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد.
سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولاإله غيرك.
الله اكبر كبيرا ، الله اكبر كبيرا ، الله اكبر كبيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، وسبحان الله بكرة وأصيلا(ثلاثـــا) ـ "اعوذ بالله من الشيطان من نفحه ونفثه وهمزه ". 
 """,
    """
 دعاء دخول السوق
لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير (كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف الف درجة وفي رواية: وبنى له بيتا في الجنة).
بسم الله، اللهم إني أسألك خير هذه السوق، وخير ما فيها، وأعوذ بك من شرها وشر ما فيها، اللهم إني أعوذ بك أن أصيب بها يميناً فاجرةً، أو صفقة خاسرة. 
 """,
    """
  عنــــد فعــــل الذنب أو ارتكاب المعصية
كما أخبرنا رسول الله صلى الله عليه وسلم ((ما من عبد يذنب ذنباً فيتوضأ فيحسن الطهور،ثم يقوم فيصلي ركعتين ، ثم يستغفر الله لذلك الذنب إلاَّ غُفر له )).
 """,
    """
 الدعـــاء عنــــد سماع أصوات الحيوانات
الدعاء عند صياح الديك : (( اللهم إني أسألك من فضلـــك )). ((إذا سمعتم صياح الديك[من الليل]،فاسألوا الله من فَضْلِهِ فإنها رأت ملكاً و إذا سمعتم نهيق الحمار،فتعوَّذوا بالله من الشيطان فإنها رأت شَيْطَاناً)). متفق عليه.
الدعاء عند صياح الديك و نهيق الحمار و نباح الكلاب: (( أعوذ بالله من الشيطان الرجيم )).
((إذا سمعتم نُباحَ الكلاب و نهيق الحمير بالليل فتعوذوا بالله فإنهن يَرَيْنَ ما لا ترون)). صحيح(صحيح سنن أبي داود3/961) 
 """,
    """
 سيد الاستغفار
اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت.
عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال ( سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت ) من قالها في النهار موقناً بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقناً بها فمات قبل أن يصبح فهو من أهل الجنة . أخرجه البخاري. 
 """,
    """
  الدعـــاء إذا أحسست بوجع في جسدك
ضع يدك على الذي تألَّم من جسدك وقل: بسم الله ،ثلاثاً ،وقل سبع مرات: أعوذُ بالله وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ.
 """,
   """
  مايقول ويفعل من أذنب ذنباً
مامن عبد يذنب ذنباً فيحسـن الطهور ثم يقوم فيصلي ركعتين ، ثم يستغــفــر الله إلا غفر له 
 """,
"""
اللّهم إنّي أعوذ بك من منكرات الأخلاق ، و الأعمال و الأهواء.
""",
"""
اللّهم إنّي أعوذ بك من قلب لا يخشع ، و دعاء لا يُسمع و من نفس لا تشبع ،
و من علم لا ينفع ، أعوذ بك من هؤلاء الأربع .
""",
"""
اللّهم إنّي أعوذ بك من زوال نعمتك ، و تحول عافيتك ، و فجأة نقمتك ، و جميع سَخطك .
""",
"""
اللّهم إنّي أعوذ بك من جار السوء في الدار المقامة ، فإن جار البادية يتحول .
""",
"""
اللّهم إنّي أسألك علماً نافعاً و رزقاً طيباً متقبلاً .
""",
"""
اللّهم إنّي أعوذ بك من شر ما عملت و من شر ما لم أعمل.
""",
"""
اللّهم إنّي أعوذ بك من يوم السوء ، و من ليلة السوء ومن ساعة السوء ،
و من صاحب السوء ، و من جار السوء في دار المقامة.
""",
"""
اللّهم أكثر مالي و ولدي و بارك لي فيما أعطيتني .
""",
"""
اللّهم إنّي أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد
و لم يكن له كفواً أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم .
""",
"""
لا إله إلّا الله العظيم الحليم ، لا إله إلّا الله رب العرش العظيم ، لا إله إلّا الله ربُ السماوات و ربُ الأرض و ربُ العرش الكريم
""",
"""
اللّهم إنّي أسألك الجنة و أستجير بكِ من النار .
""",
"""
اللّهم قنعني بما رزقتني و بارك لي فيه و أخلف عليَّ كل غائبة لي بخير
""",
"""
اللّهم ألهمني رشدي و أعذني من شر نفسي .
""",
"""
اللّهم إنّي أسألك العافية في الدنيا و الآخرة .
""",
"""
اللّهم متّعني بسمعي و بصري و اجعلهما الوارث مِنيِّ و انصرني على مَن يظلمُني ، و خذ منه بثأري .
""",
"""
اللّهم أعني على ذكرك و شكرك و حُسن عبادتك .
""",
"""
اللّهم أحسن عاقبتنا في الأمور كلّها ، و أجرنا من خزي الدنيا و عذاب الآخرة .
""",
"""
اللّهم إنّي أعوذ بكِ من العجز و الكَسل و البُخل و الهرم و عذاب القبر .
""",
"""
اللّهم آتِ نفسي تقواها و زكّها أنتَ خيرُ من زكاها ، أنتَ وليها و مولاها .
""",
"""
اللّهم إنّي أعوذ بك من علمٍ لا ينفع ، و من قلب لا يخشع و من نفس لا تشبع ، و من دعوة لا تستجاب لها.
""",
"""
اللّهم إنّي أسئلك حبك و حب من يُحبك و العمل الذي يبلّغني حبك
""",
"""
اللّهم اجعل حبّك أحب إليّ من نفسي و أهلي و من الماء البارد .
""",
"""
اللّهم إنّي أسألك من خير ما سألك منه نبيك محمد صلى الله عليه و سلم
و نعوذ بك من شر ما إستعاذ منه نبيك محمد صلى الله عليه وسلم ،
و أنتَ المستعان و عليك البلاغ ولا حول ولا قوة إلّا بالله ، اللّهم إنّي أسألك علماً نافعاً و أعوذ بك من علم لا ينفع.
""",
"""
اللّهم ربَّ جبرائيل و ميكائيل وربَّ إسرافيل أعوذ بك من حر النار و من عذاب القبر .
""",
"""
اللّهم إنّي أعوذ بك من شر سمعي ، و من شر بصري و من شر لساني ، و من شر قلبي و من شر منيي 
""",
"""
اللّهم إنّي أعوذ بك من العجز و الكسل و الجبن و البخل و الهرم و القسوة و الغفلة و العلية و الذلة و المسكنة و أعوذ بك من الفقر و الكفر و الفسوق و الشقاق و النفاق و السمعة و الرياء ، و أعوذ بك من الصم و البكم و الجنون و الجزام و البرص و سيء الأسقام .
""",
"""
اللّهم فقهني في الدين ، اللّهم احفظني بالإسلام قائماً ، و احفظني بالإسلام
قاعداً و احفظني بالإسلام راقداً ولا تشمّت بي عدواً ولا حاسداً
اللّهم إنّي أسألك من كل خير خزائنه بيدك ، و أعوذ بك من كل شر خزائنه بيدك.
""",
"""
اللّهم حاسبني حساباً يسيراَ ، اللّهم إنّي أسألك فعل الخيرات
و ترك المنكرات و حُب المساكين و أن تغفر لي و ترحمني ،
و إذا أردت فتنة قوم فتوفني غير مَفتون و أسألك حُبّك ، و حب من يُحبِك ، و حُب عمل يقربني إلى حُبك.
""",
"""
 اللّهم قني شر نفسي و اعزم لي على أرشد أمري ، اللّهم اغفر لي
ما أسررت و ما أعلنتُ ، و ما أخطأتُ و ما عملتُ و ما جهلتُ .
""",
"""
ربِ أعني ولا تعن عليّ ، و انصرني ولا تنصر عليّ و امكر لي ولا تمكر عليّ
و اهدني و يسر الهدي إليّ ، و انصرني على من بغى عليّ .
ربِ اجعلني لكَ شاكراً لك ذكاراً ، لكَ رهَاباَ ، لكَ مطواعاً إليك مخبتاَ أوّاهاً منيباَ ،
ربِ تقبل توبتي ، و اغسل حوبتي ، و أجب دعوتي
و ثبّت حُجتي و اهدِ قلبي ، و سدد لساني ، و أسْلُلْ سخيمة قلبي .
""",
"""
اللّهم إجعل أوسع رزقك عليّ عند كبر سني ، و انقطاع عمري ،
اللّهم إنّي أسألك بأني أشهد أنكَ أنتَ الله لا إله إلّا أنتَ
الأحد الصمد الذي لم يلد و لم يولد و لم يكن له كفواً أحد .
""",
"""
اللّهم طهرني من الذنوب و الخطايا ، اللّهم نقني منها كما يُنقى الثوب من الدنس ،
اللّهم طهرني بالثلج و البرد و الماء البارد .
""",
"""
اللّهم ألهمني رشدي ، و أعذني من شر نفسي.
""",
"""
اللّهم رب السماوات السبع و رب الأرض ، و رب العرش العظيم ،
ربنا و رب كل شيء ، فالق الحب و النوى ، و منزل التوراة و الإنجيل و الفرقان ،
أعوذ بك من شر كل شيء أنتَ آخذ بناصيته ، اللّهم أنت الأول فليس قبلك شيء ،
و أنت الآخر فليس بعدك شيء ، و أنت الظاهر فليس فوقك شيء ،
و أنت الباطن فليس دونك شيء ، إقضِ عنا الدين و اغننا من الفقر .
""",
"""
اللّهم ألف بين قلوبنا ، و أصلح ذات بيننا ، و اهدنا سبل السلام ،
و نجنا من الظلمات إلى النور ، و جنبنا الفواحش ما ظهر منها و ما بطن ،
و بارك لنا في أسماعنا ، و أبصارنا ، و قلوبنا ، و أزواجنا ، و ذرياتنا ،
و تب علينا إنك أنت التواب الرحيم ، و اجعلنا شاكرين لنعمتك مثنين بها عليك قابلين لها و أتممها علينا.
""",
"""
اللّهم جنبني مُنكرات الأخلاق ، و الأهواء ، و الأعمال ، و الأدواء .
""",
"""
اللّهم قنعني بما رزقتني ، و بارك لي فيه ، و اخلف عليّ كل غائبة لي بخير.

""",
"""
اللّهم إنّي أسألك إيماناً لا يرتد ، و نعيماً لا ينفذ ، و مرافقة محمد صلى الله عليه وسلم في أعلى جنة الخلد.
""",
"""
اللّهم قني شر نفسي ، واعزم لي على أرشد أمري ، اللّهم اغفر لي ما أسررت ،
و ما أعلنت ، و ما أخطأت ، و ما عمدت ، و ما علمت ، و ما جهلت .

""",
"""
اللّهم لك الحمد كلّه ، اللّهم لا قابض لما بسطت ، ولا باسط لما قبضت ،
""",
"""
اللّهم لك الحمد كلّه ، اللّهم لا قابض لما بسطت ، ولا باسط لما قبضت ،
ولا هادي لمن أضللت ولا مضل لمن هديت ، ولا مُعطي لما منعت
ولا مانع لما أعطيت ، ولا مُقرب لما باعدت ، ولا مُباعد لما قربت.
""",
"""
اللّهم إنّي أسألك النعيم المُقيم الذي لا يحول ولا يزول ، اللّهم إنّي أسألك النعيم يوم العيلة ، و الأمن يوم الخوف.
""",
"""
اللّهم إنّي عائذ بك من شر ما أعطيتنا و شر ما منعتنا ،
اللّهم حبّب إلينا الإيمان و زينهُ في قلوبنا و كرّه إلينا الكفر و الفسوق و العصيان و اجعلنا من الراشدين.
""",
"""
اللّهم توفنا مسلمين ، و أحينا مسلمين ، و ألحقنا بالصالحين غير خزايا ولا مفتونين ،
اللّهم قاتل الكفرة الذين يكذبون رسلك و يصدون عن سبيلك ، و إجعل عليهم رجزك وعذابك.
""",
"""
اللّهم زدنا ولا تنقصنا وأكرمنا ولا تهنا وأعطنا ولا تحرانا و آثرنا ولا تؤثر علينا و ارضنا و ارضَ عنا.
""",
"""
اللّهم كما أحسنت خَلقي فأحسن خُلُقي .
""",
"""
اللّهم ثبتني و اجعلني هادياً مهدياً .
""",
"""
اللّهم آتني الحكمة التي من أوتيها فقد أوتي خيراً كثيراً.
""",
"""
اللّهم اغفر لي خطيئتي و جهلي ، و إسرافي في أمري و ما أنتَ أعلم به مني ،
اللّهم اغفر لي جدّي و هزلي و خطئي و عمدي وكل ذلك عندي ،
اللّهم إغفر لي ما قدمت و ما أخرت و ما أسررت و ما أعلنت و ما أنتَ أعلم به مني ،
أنت المقدم و أنتَ المؤخر و أنتَ على كل شيٍء قدير.
""",
 """دعـاء الخوف من الشــرك
اللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم """

]

yousef_responses = [
    "الحمد لله بخير",
    "بخير انت شلونك",
    "طيبين طيبين",
    "بخير"
]

yousef1_responses = [
    "مساء الورد",
    "مساء العسل",
    "مساء بحلاوة وجهك",
    "مساء نوره أنت",
    "مساء الجوري",
    "مساء الياسمين",
    "مساك الله بالخير",
    "مساء الحلاوة"
]

@bot.message_handler(content_types=['text'])
def handle_text(message):
    text = message.text.lower()
    if "اجر" in text:
        response = random.choice(responses)
        bot.reply_to(message, response, reply_markup=get_inline_keyboard())
    elif "كيمقنف الحال" in text:
        response = random.choice(yousef_responses)
        bot.reply_to(message, response, reply_markup=get_inline_keyboard())
    elif "مساء اهثهثغبخلخير" in text:
        response = random.choice(yousef1_responses)
        bot.reply_to(message, response, reply_markup=get_inline_keyboard())

def get_inline_keyboard():
    markup = types.InlineKeyboardMarkup()
    button1 = types.InlineKeyboardButton("النجار | Alnajar", url="https://t.me/alnajar")
    button2 = types.InlineKeyboardButton("Hasoni Alnajar", url="t.me/hsshh")
    markup.add(button1, button2)
    return markup
    
bot.polling(True)
